---
kind: property
id: P:Autodesk.Revit.DB.ViewScheduleExportOptions.FieldDelimiter
source: html/5a765ce4-da82-c9fd-cd6d-289df73c6b29.htm
---
# Autodesk.Revit.DB.ViewScheduleExportOptions.FieldDelimiter Property

How to delimit fields. Default is Tab.

## Syntax (C#)
```csharp
public string FieldDelimiter { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null